{
    "acts_num": 1,
    "script": [
        "Lin xiaohua\n\nYou have always felt that you are the Cinderella in the fairy tale. After the biological mother died, no one hurts and no one loves it. Dad married his stepmother and gave birth to a younger brother.In the eyes.When you were 18 years old, my father sent you into a university and told you that the son of the Zhang's consortium will go to this school. In the future, you will be his fiancee.Marry him.You know that you are not qualified to resist, you can only obey, I hope it is a good person.\nWhen you go to college to see your fiance ZHANG EBA, you immediately feel that the world is dark.This Zhan Eba relied on his rich and powerful dad to do anything wrong, and he was even more colorful. The woman around him changed his ends for three days.After you understand these situations, you once told your father euphemistically.My father said coldly that Zhang Gongzi, a idiot, had to marry for business.\nThe father's retirement was unable to go. You decided to start from ZHANG EBA and let Zhang Eba hate him to take the initiative to retire.So you secretly told Chairman Zhang about the bad things that ZHANG EBA did at school and asked Chairman Zhang to reprimand ZHANG EBA.Unexpectedly, after Chairman Zhang reprimanded ZHANG EBA, ZHANG EBA found you to hit you, scolding you to monitor your cheap goods. In this life, you have been torture who torture.\nYou did not expect to arouse this thought of Zhang Eba, and despair made you squat and cry on the ground.At this time, a person comes alone, and it is your Zhao Shuai. He helped you up and wiped your tears. He said that there was nothing to get through.You have never seen such a gentle and handsome man, and you move your heart at once.\nYou feel that you fall in love with this person, and even dare to write a love letter to him.Unfortunately, after that encounter, Zhao Shuaige was cold and faint. After receiving a love letter, I was embarrassed, \"You are the fiancee of ZHANG EBA, I am his friend, you are not so good.Will keep you secret, but please don’t do this in the future. \"\nIn your heart, you think that this zhang eba has a fiancee but can be happy outside, but because he can't pursue happiness, he is hopeless if he dies.After this idea enters your head, you can't wipe out. Think about that if you marry him in the future, you will not only have to watch him spend every day, but you will be beaten with a little uncomfortable heart. It is better to kill him now.You can also pursue your own happiness.\nFortunately, you have your girlfriend Hao Guimi to relieve you. You often pour hard water with her. Every time you talk to her, you will feel a lot easier.\n\nYou listen carefully in the black market, and finally got a box of toxic drugs, and there are some supporting things, but you have never found a chance to study.A few days after buying poison, ZHANG EBA suddenly came to find you, saying that he and Zhao Shuaige bet to explore the old teaching building in the evening of the Chinese Yuan Festival, and asked you to take your girlfriend hao Guimi together, just to make up for 6 peopleEssenceYou were hesitant to agree, but he heard the name of Zhao Shuaige immediately and agreed immediately, and called HAO Guimi.You put the poison box in the bag, and it should be a chance this time.At the same time, you also drew a beautiful makeup and want to attract the attention of Zhao Shuai.\n[Zhongyuan Festival, 11 pm]\nYou bring Hao Guimi to gather at the back door of the school. You frequently look at Zhao Shuaigee, but Zhao Shuaige is not moved, which disappoints you.\nWang Xuexi and Li Xiaodi opened the door of the old teaching building. The group went to the 4th floor. There were two stairs in the east and west heads of the teaching building.Step.ZHANG EBA was a little impatient and wanted to go back.Zhao Shuai said that we will try the next one. Let ’s try the next. The group of people agree, and ZHANG EBA nodded.\nAt 11:15, the group came to the biological room on the 4th floor, and ZHANG EBA ordered Wang Xuexi to check the faucet.Wang Xuexi opened the water faucet and stretched out the hand to touch the water. You were doubtful about these legends, so you stared at Wang Xuexi's hand highly, but saw a blood red on the hand that came back. You can't help but shocked.Screaming, blood!Wang Xuexi also screamed, and fell off the flashlight to the ground with missed hands, and the flashlight immediately went out.After getting into the dark, everyone's cry is louder. You are scared and fled, and ran to the toilet on the second floor and hid in the innermost compartment.After calming down, you feel that the surroundings are even more scary, so you have to persuade yourself, there is no spirit, it is fake.\nAt 11:20, you are calm, and you think it ’s a bit weird tonight. It is a good opportunity to start. You ca n’t drag any more, otherwise you will regret it for life.With the weak moonlight, you open the poison and use instructions.The poison is called a death smile, which is powder -like. After sprinkle the person who wants to deal with, once the person is inhaled, the lungs will be paralyzed, the whole body is stiff, the facial muscles will twitch, and the expression of a smile will be formed.die.In order to prevent poisoners from taking mistakes, there is also a bottle of antidote for taking it in advance.\nYou just prepared to take the medicine, but he heard the voice of people talking outside the door. It was li xiaodi. To open the toilet door to see, you found that you were hiding in the fourth legendary toilet.You are afraid that they will find themselves, and immediately make a cried cry in the hurry, and slowly push the door open, slowly extending their arms out of pretending to be a female ghost.Sure enough, the two yelled, and immediately ran away.\nAt 11:25, you quickly took the antidote, carried poison and other things, and then went out of the old teaching building.You are going to find ZHANG EBA, but suddenly see Zhang Eba yelling, \"Don't kill me! Don't kill me!\" Running in the direction of the small woods, you immediately caught up.\n\nAt 11:33, when you ran to the dry well, you saw that Zhang Eba fell, and he kept back and retreated until you couldn't retreat until you leaned at the dry well. You kept waving your hands in the air, don't come over!Don't come here!Go away!Obviously it was scared.\nYou think in your heart, you are really evil, let me liberate me.You took out the poison and spilled on the face of ZHANG EBA, Zhang Eba immediately stopped moving, and a strange smile appeared on his face.After a while, you stepped forward and touched his pulse, which stopped.So you go back from the back door to the old teaching building, hiding outside the teaching building and waiting for the time.\nAt 11:45, you saw Wang Xuexi come out of the old teaching building, so he quietly followed up, just preparing to catch up to create a proof of the present, but saw a man's figure rushing from the direction of the dead well to the forest.Wang Xuexi stunned and went to the dry well. You don't want to go to the dry well anymore. Just look at Wang Xuexi and go to the principal statue.\nAt 11:50, before you arrived at the statue of the principal, you saw Li Xiaodi and Hao Guimi. You said that you had stayed in the old teaching building for a long time and no one saw it.After 5 minutes, Wang Xuexi came, and he said he had been staying on the 4th floor of the biological room.At the end of the last 12 o'clock, Zhao Shuaige also came. He said that now ZHANG EBA is not here, we will wait for him for a while.\nAt 0:00, five of you waited for ZHANG EBA in front of the statue. At this time, I saw a black shadow coming from the school door.The voice of \"wow la la\", and when I stepped towards you, it was obviously not ZHANG EBA.At this time, Zhang Shuai said, whether it was the seventh person.You shouted immediately, ghost!Then he ran away, scared everyone, and then everyone went home from the back door over the wall.After returning, you destroy all the things related to poison, and fell asleep at ease.\nThe next day, ZHANG EBA's death news was passed out, and you were summoned as a suspect ..."
    ],
    "acts_goal": [
        "Obviously, you are the murderer, please hide yourself from being discovered."
    ],
    "questions": [],
    "victims": [
        "Zhang Eba"
    ],
    "final_goal": "",
    "acts_performance": [],
    "secrets": "",
    "is_murderer": 1,
    "kill_by_me": [
        1
    ]
}