{
    "acts_num": 1,
    "script": [
        "Lin Ruotong (singer)\nIntroduction to characters:\nFemale 31 years old working on the boat for one year. It is the exclusive jazz singer of the Oriental Star Bar. You are very beautiful and attract everyone's attention.\nThe impression of the deceased and the statement of not presenting (what are you doing at the time of the incident). Qi often comes to a bar, so just chat with him in the bar, ordinary friends.Because of 20:30 in the evening, a bar performance is held, and this time is prepared for the upcoming performance in the room during this time.\nYour secret:\nYou and Captain Hong are real lover, but forced you to have a date with LIU QI recently, and have been dating 3 times.\nYour interpersonal relationship:\nLiu qi (Da Deputy): Liu Qi is one of your pursuers. He gave you a brand -name bag, but you don't like him.You owed 1 million debts last year and were unable to repay. After learning about it, he took the initiative to help you repay, but asked for a date with you 10 times to reach the money. You agreed and signed a contract contract with him.(Dating is watching movies, eating)\nHong Zilian (Captain): He is your lover, he calls you \"Xiaohuang\", he doesn't know what you and Li Qi secretly date.\nZhang wenyuan (two sideways): You know he is a gun custodian, and there is a left wheel pistol in the hello room\nHan Yimu: You learned recently that she helped you get a nickname. You are very angry with \"Lin Magnet\". On May 6th, find a fault to quarrel with her in public.After that, the captain came to criticize her on the grounds that the customer was affected.\nXiu Renjie (Manager): He is your direct leader, you know he likes drinking, especially foreign wine.\nCase:\nAt 19:45 that day, you met with Liu Yue in the warehouse through SMS.At that time, you wore a performance suit. As soon as you arrived at the warehouse, Liu Qi rushed to you, tearing your clothes, and wanted to be affectionate with you.In a hurry, you took the sister -in -law from your head and pierced it into the back of Li Qi fiercely.While he was in pain, you escaped quickly\nAt about 20 o'clock, you returned to your room and replaced the bad clothes.You are very angry and scared. You suddenly remember your lover Captain Hong. Here you have a private left wheel pistol at 20:20. You secretly ran to the captain's room to steal Captain Hong's pistol and hidden in your wardrobe's bag.\nAt 20:30, you were notified liu qi to die\nYour other information:\n1captain hong recently gave you a necklace."
    ],
    "acts_goal": [
        "Your goal is to work together with everyone to find the hand behind this case, but at the same time, be careful not to be suspected. \\N2. The prisoner is the only person on the field who can lie. You cannot lie, but you can conceal some evidence that is unfavorable to yourself"
    ],
    "questions": [],
    "victims": [
        "Liu Qi"
    ],
    "kill_by_me": [
        0
    ],
    "final_goal": "",
    "acts_performance": [],
    "secrets": "",
    "is_murderer": 0
}