{
    "acts_num": 1,
    "script": [
        "Hao guimi\n\nYour Cousin Sister go to school in the best university in the country. She is both your closest peers and the goal you chase. You work hard to reunite with your sister in H University.\nBut when you are full of confidence, you want to show your simulation test to the Cousin Sister that you can be admitted to H big, but the news of his sister suicide came from the family.No matter how you ask your family, you just don't tell you why the Cousin Sister committed suicide, and let you learn not to think about it.You will not believe that the lively and cheerful Cousin Sister will commit suicide for no reason, so you doubled hard to learn to be admitted to H Da, and go to the place where your sister committed suicide to find out.\nAfter you go to college, you will know the ins and outs of the matter.It turned out that ZHANG EBA, who was the same as Cousin Sister, saw the beautiful Cousin Sister, and raped her if she couldn't be embarrassed and angry.She also took her naked photos to threaten her, and the Cousin Sister, who was ashamed and helpless, had to choose to commit suicide.And Zhan Eba's family was rich and powerful, and it took a lot of money to calm down all parties, and threatened the Cousin Sister family, which calmed down.You are very sad, and make up your mind to avenge the Cousin Sister, and let the bully pay for the price of life.\nYou inquire about ZHANG EBA's fiancee -LIN XIAOHUA, who is the same student as you, so he found a chance to become a good friend of Lin Xiaohua. He met ZHANG EBA with Lin Xiaohua and appeared around ZHANG EBA from time to time, causing it, which caused, causing it, which caused, causing it, causing it, which caused, causing it, which caused, causing it, which caused, causing it, which caused, causing it.ZHANG EBA's attention.\nThis zhang eba is really lustful, as long as he is a little bit of woman, he will not let go.You also learned from the lin xiaohua mouth that this Lin Xiaohua does not want to marry ZHANG EBA, but she has no way to control the pressure at home.This zhan Eba not only doesn't like her, but also beats her often.You sympathize with Lin Xiaohua, which is even more determined to kill ZHANG EBA.\nYou plan to dig a trap in a deep pit in the forest, and then deceive ZHANG EBA into the forest, push him down while he doesn't pay attention, and smash him with a stone, causing him to fall into the pit into the pit.I accidentally touched the illusion of death.So you spend a few days dig a trap in a secret place in the forest. Choosing this place is to sacrifice your Cousin Sister. You heard that the Cousin Sister hangs suicide in this forest.\nPerhaps it was God's care, and the opportunity to kill ZHANG EBA soon came.On the day before the 14th Middle School in July 14th, Lin Xiaohua asked you to go to the old teaching building to explore with ZHANG EBA in the evening in the evening, and take a look at the legendary \"unbelievable incident of the Higa Campus\" in the school.It's false.You agreed if you didn't think about it, and planned to scare ZHANG EBA in the forest.\n\n[Zhongyuan Festival Night, 11 o'clock\nYou and Lin Xiaohua came to the back door of the school and ZHANG EBA. You drew a beautiful makeup. A few days ago, ZHANG EBA has obviously pursuing you.ZHANG EBA, cheated him to the forest.\n6 of you enter the school from the back door over the wall.Wang Xuexi and Li Xiaodi opened the door of the old teaching building. The group went to the 4th floor. There were two stairs in the east and west heads of the teaching building.Step.ZHANG EBA was a little impatient and wanted to go back.Zhao Shuai said that we will try the next one. Let ’s try the next. The group of people agree, and ZHANG EBA nodded.\nAt 11:15, the group came to the biological room on the 4th floor, and ZHANG EBA ordered Wang Xuexi to check the faucet.Wang Xuexi opened the water faucet and stretched his hands over to touch the water. When he retracted his hand, he had a blood red.At this time Lin Xiaohua screamed in shock, blood!Wang Xuexi also screamed, and fell off the flashlight to the ground with missed hands, and the flashlight immediately went out.Everyone's call is even greater after being caught in the darkness.\nWhen you hear someone panicked out, you ran out when you were afraid.After running to the second floor, I found that I left myself. You thought that such a good opportunity tonight could not be wasted, so I comforted myself and turned back to the biological room on the 4th floor to find them.When I went to the biological room, I saw Li Xiaodi out of it. Li Xiaodi said that there was no one in it. The two discussed to decide to take a look on the 5th floor.\n11: 20, li xiaodi and you see ZHANG EBA and WANG XUEXI in the music room on the 5th floor, Wang Xuexi is using his mobile phone to look at Belndor's eyes with his mobile phone.Li xiaodi gave Zhang Eba a bottle of water attentively after entering, and praised ZHANG EBA.When you see ZHANG EBA, you feel that the time is mature, so you call him aside, implying that ZHANG EBA and you go to the forest alone, and let ZHANG EBA support Wang Xuexi and Li XIAODI.ZHANG EBA is really happy. He turned to order WANG XUEXI and li xiaodi to check the toilet on the second floor.\nAt 11:25, you and ZHANG EBA arrived at the forest, and you brought ZHANG EBA near the trap.You quietly kick a stone on the road, and a tree in front of the tree suddenly falls a long -haired white ghost, that is the dummy you set in advance to scare ZHANG EBA.In this way, you know that ZHANG EBA is a very courageous person. You want to go forward to check with the boldness of ZHANG EBA, and then push him into the deep pit while he is unprepared.I didn't expect ZHANG EBA to be scared as soon as she saw the white shadow, yelled at me!Do not kill me!You hang up and commit suicide by yourself, don't care about my business, and then turn around and run.When you want to catch up, ZHANG EBA has run out.You have to give up the plan to kill him tonight. In order not to be discovered by others, you put the dummy down and throw it into the deep pit together with the rope.\nAt 11:30, as soon as you threw the dummy in, you heard the sound of footsteps and found that Zhao Shuaige came back. Fortunately, the small forest vision was not good at night.Stop Zhao Shuaige's sight.Fortunately, Zhao Shuaige just inquired about Zhang Eba's whereabouts. You told Zhao ShuaaiGezhang Eba to run towards the old teaching building like a crazy, and then Zhao Shuaige hurried away.\n\nThen you find something to hide the entrance easily. After doing these, you decide to go to the statue of the principal to see what happened to ZHANG EBA because it agreed there to gather there.\n11:45, you did not come to the principal's statue, nor a person.At this moment, Li Xiaodi also came. You asked him if he had seen ZHANG EBA, and Li Xiaodi said he has been in the old teaching building, and no one can see it.Because the legend of the principal statue at 12 o'clock, the two decided to wait here for a while.After 5 minutes, Lin Xiaohua came, saying that he had stayed in the old teaching building for a long time, and no one saw it.After another 5 minutes, Wang Xuexi came, and he said he had been staying in the biological room on the 4th floor.At the end, Zhao Shuaige also came at 12 o'clock. He said that now Zhang Eba hasn't come together, everyone will wait.\nAt 0:00, five of you waited for ZHANG EBA in front of the statue. At this time, I saw a black shadow coming from the school door.The voice of \"wow la la\", and when I stepped towards you, it was obviously not ZHANG EBA.At this time, Zhang Shuai said, is it a person who is more?Lin XiaoHua immediately screamed and shouted to ghosts!Everyone was frightened and ran away, and went home from the back door.\nAs a result, the news of ZHANG EBA came from the next day, and you were summoned as a suspect ..."
    ],
    "acts_goal": [
        "You are not the murderer, please clear the suspicion and uncover the truth of the incident."
    ],
    "questions": [],
    "victims": [
        "Zhang Eba"
    ],
    "final_goal": "",
    "acts_performance": [],
    "secrets": "",
    "is_murderer": 0,
    "kill_by_me": [
        0
    ]
}