{
    "acts_num": 3,
    "script": [
        "He laoliu\nYou are He Laoliu, one of the murderers of the crushed corpse rape.The crushing corpse rape that shocked the city was done by you and the other two colleagues.Your usual work is the night security of the Cube Community.Responsible for the community night security work and access control.\nYou are born in the countryside, and there are five sisters in your family.My father is a male light and daughter. Even if the family has already been eclipsed and stretched, I will have a baby who is going to have a boy until your birth.\nYou have lived with five sisters since you were a child, because the family was not going to have extra rooms, and I slept with my sisters.You are very ignorant about the woman's body. From time to time, you will secretly touch your sister's body. Slowly, you have a desire to suppress or even abnormal.\nYour academic performance is not good. In addition, the teacher in the school is expelled from the student.My father can't help but let you go to the city to work, but you still have a hard time to change in a property company. Volue to the female colleagues to go to the toilet.Apart from.At this time, a middle -aged man pleaded with you and recruited you to the cubic community to do night duty.\nThis middle -aged man is called Li Guofu.He is the night shift security captain of the property company in the Cube District.Said to be the captain, in fact, you are alone.You asked Li Guofu why he saved you, he smiled weirdly, and asked if you dare to do big tickets, and secretly touched what he had.\nSubsequently, Li Guofu set up security monitoring at two in the morning, rode motorcycles, and went to a remote house.Li Guofu has long been stepped on, and there is only a little girl in the private house.You can see that Li Guofu does not care about the girl's cry and implement the beast.\nIn this scene, you feel that the desire that has been suppressed for a long time instantly finds the release of the release, and you don't even hold back and participate in person.But one thing that can't be accepted is that after Li Guofu's Beast Walk, you must kill each other.You are very scared, Li Guofu asked you to flip the value, and he started.\nIn this way, you set up a gang of two people. Li Guofu is responsible for stepping on and broken corpses. You are responsible for stealing Dongxi.Half a year later, another person joined you, a girl named ZHANG JIE.She was actually very interested in this matter, and also joined the Night Security Team, responsible for stepping on the work.\nDuring the day when you sleep with Li Guofu, ZHANG JIE goes out to step on the point. She is a girl itself, and it is easier to get close to those single women.Within three years, the three of you have committed the crime, killed nineteen people, and robbed 1.2 million yuan.Li Guofu is a team think tank. He is responsible for planning. Each crime is seamless. Even if some people doubt you, Li Guofu will take out the video evidence of the community to prove that you are patrolling on duty that night.You don't know how to do the video, but that is indeed perfect.\nHalf a year ago, the security guard team came again at night. She was a woman named MU BEI. She looked in her thirties and was also beautiful.It didn't take long for the community to open the back door, so the four of you scored into two teams, which seriously hindered the opportunity for you to commit crimes.Li Guofu's class allows the four of you to rotate the front door and the back door.The back door is relatively easy, because almost no one goes.\nOn the night of you and Li Guofu's back door, you asked Li Guofu. This MU BEI is too troublesome. You haven't gone out for a long time. Would you like to take her away?Li Guofu said categorically, this person can't move, so that you and ZHANG JIE should not move your brains recently. Let's rest for a while.\nTwo months later, the residents in the community have a Big Brother Wang. I often come to the duty room in the middle of the night to find you and Li Guofu gambling poker, just to pass the time of you and Li Guofu's \"loneliness\".But later, Neighbor Wang and Li Guofu gambled greater and larger. The winning or losing of each game began to be tens of thousands. You can't participate in this tens of thousands of gambling games, but if you count your psychology, Li Guofu will probably owe NEIGHBOR WANG more than 200,000.EssenceThis neighbor Wang is not a good -looking master. He is idle all day long, and there is a brother under his hand.Li Guofu wants to rely on the account, but Neighbor Wang does not do it. Two people have a long quarrel because of this.\nThree days ago, the second sister wrote a letter saying that Dad was sick and needed 100,000 medical expenses.You promised the second sister and said that you would find a way as soon as possible. You and Li Guofu showed their cards. I hope that from the money that I have grabbed in these years, I will give you 100,000.Li Guofu said that the money could not move.Do you think it was Li Guofu and lost money or misappropriated.\nYou roughly count as your own, and there are 400,000. When you return to your hometown to serve your father, it is enough to build a house to marry a daughter -in -law.So you put forward that you want to scatter the part and take away the part you deserve, but you have been obscured by Li Guofu and rejected.\nTonight, you and MU BEI are on duty at the back door. The second sister asked the phone to urge money again.polite!After ten minutes, Li Guofu gave you a text message: \"Brother, you find a chance to come to the community fountain, I explain it with you. Be careful not to let MU BEI discover.\"\nThere is no toilet in the back door on duty. You excuse your pretext, and you slip out. He hurried to the fountain. The community is very dark, but there is a decorative light in the fountain. You see it from a distance. Someone stands next to the fountain. SuddenlyPour in the fountain pool, you hurried over and found that the Li Guofu was in the pool.You pulled him up and asked him what happened. Li Guofu pointed behind him and then swallowed. You turned Li Guofu's body and found that he had a dagger in his back.When you didn't know what to do, Neighbor Wang appeared behind you, and he immediately reported to the police when he saw this.\n\"Tonight Tonight\" (maybe a few minutes of error before and after):\n21:00 at the back door and MU BEI duty\n21:50 Send a text message to Li Guofu\n22:00 Li Guofu reply to meet you in the fountain\n22:13 See Li Guofu down to the pool\n22:15 Pick up Li Guofu to see Neighbor Wang\n22:20 neighbor Wang report\n"
    ],
    "acts_goal": [
        "① You are not the murderer, clear your suspicion and do not be mistaken for the murderer. (10 points) \\ n ② Hiding oneself in a series of dismembered rape cases. (20 points) \\ n ③ Find the money and leave here. (20 points)"
    ],
    "questions": [
        ""
    ],
    "victims": [
        "Li Guofu"
    ],
    "kill_by_me": [
        0
    ],
    "final_goal": "",
    "acts_performance": [
        ""
    ],
    "secrets": "",
    "is_murderer": 0
}