{
    "acts_num": 3,
    "script": [
        "Neighbor Wang\nYou are the residents of the Cube Community.\nTwo years ago, your wife disappeared.After many efforts, Police was determined that the population disappeared, and there was no following.\nAt the same time, the serial rape crushing case that shocked the whole country was reported by reporters.Although the police tried their best to conceal, reporters still counted all the number of people who were raped within two years.All cases were very similar. At the beginning, there were still corpses, and a large number of corpses were found.You suspect that your wife is also broken, and there is no trace to follow.\nYou miss your wife very much, and you start to mix in society and find more clues.Visit the families exposed by reporters and raped corpses.Because you are focusing on investigating your wife, you have resigned, and you spend savings soon without the source of income.\nOccasionally, when you see the night shift security captain of the community, Li Guofu played cards with his mobile phone, and he usually spend some money.You are a masterpiece, and you can even do some simple out. You have a lot of money. If you want to flicker Li Guofu, win some money from his hands.So every time Li Guofu duty at night, you will find him to play cards. Li Guofu is also a good gambling person. He deliberately arranges He Loliu, who also loves to play cards on duty in front of the class, so that you can fight the landlord in the duty room.\nIn order to quote Li Guofu into the set, you always lose to him intentionally or unintentionally. You deliberately sell stupidly. Under your intention, your gambling game is getting bigger and bigger.He Laoliu saw you two gambling, and he would not participate, leaving you play cards with Li Guofu.You gradually start to make a thousand, winning more than 200,000 gambling funds in Li Guofu, you asked Li Guofu to write you up.However, after Li Guofu gave you 10,000, he shoved to say that he had no money, and returned you slowly after paying the salary.But you are anxious to use the money as an expense of investigating the truth of your wife. On the one hand, you are closely forced to debt, and on the other hand, you want to make Li Guofu owe you more.\nBut I didn't know what happened a while ago, Li Guofu suddenly canceled the card, and rarely had a duty with He Laoliu. He always arranged for the ladies to duty with him.You feel that this Li Guofu wants to rely on the account. You can't help it in your heart. You are ready to start threatening Li Guofu and find some friends in society to send him to him: This money is not repaid, you do everything!Li Guofu later said that he would pay off once after a while, but recently let you not go to him. He has important things to do.\nTonight, when you are upstairs, you can see Li Guofu out of the duty room, and we wore shoes to go downstairs. I want to ask if he can return you a little bit. After all, the money you eat is almost gone.When I walked to the first floor, I saw someone dragging something in the fountain. You hurried over and saw He Laoliu holding Li Guofu just just removed from the fountain pool.You see Li Guofu's continuous bleeding, and even dyed the water in the fountain pool. When you go back to God, you can call the police. When you put down the phone, you see He Laoliu glanced at you with doubtful eyes., Thinking.\n\"Tonight Tonight\" (maybe a few minutes of error before and after):\n22:05 You saw Li Guofu out of the front door upstairs from the front door;\n22:15 You arrive at the fountain and see He Laoliu removed Li Guofu;\n22:20 you call the police.\n"
    ],
    "acts_goal": [
        "① You are not the murderer, please clear your suspicion and not be mistaken for the murderer. (10 points) \\ n ② Find the real culprit of the serial rape and dismemberment case. (30 points) \\ n ③ Before determining the true culprit of the serial rape and dismemberment case, do not reveal your undercover identity. (10 points)"
    ],
    "questions": [
        ""
    ],
    "victims": [
        "Li Guofu"
    ],
    "kill_by_me": [
        0
    ],
    "final_goal": "",
    "acts_performance": [
        ""
    ],
    "secrets": "",
    "is_murderer": 0
}